Revit 2024 API
ExporterIFC.GetLayerNameForPresentationLayer Method
 Get the layer name associated with an element from the default layer mapping table.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public string GetLayerNameForPresentationLayer(
	Element pElement,
	ElementId categoryId
)
Visual Basic
Public Function GetLayerNameForPresentationLayer ( _
	pElement As Element, _
	categoryId As ElementId _
) As String
Visual C++
public:
String^ GetLayerNameForPresentationLayer(
	Element^ pElement,
	ElementId^ categoryId
)
Parameters
pElement
Type: Autodesk.Revit.DB.Element
 The element.
categoryId
Type: Autodesk.Revit.DB.ElementId
 The category id of the element.
Return Value
 The layer name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace